<template>
    <section id="about">
        <h3 class="page-title">Обо мне</h3>
        <div class="container">
            <blockquote>
                <h2>Привет! Hello! Ola! Chao! Салют ;)</h2>
            </blockquote>
            <p>Меня зовут <b>Коновченко Богдан</b>, я frontend разработчик из Санкт&#8209;Петербурга. Мне 24 года, программировать начал в 15 лет. Выбрал frontend направление в 19. Начинал со студии разработки, затем работал в интернет-магазинах, а сейчас записываю курс для Web Dev.</p>
            <p>Я рано встаю (5.30 утра), много читаю (техническая, бизнес и художественная литература + новостная лента в twitter), занимаюсь спортом (тренировочный зал, плавание, картинг), фанат формулы 1 (Феррари, Феттель и Леклер), заядлый путешественник (список стран + фото).</p>
            <p>В профессиональном плане на нынешнем месте работы я достиг уровня <b>Lead Frontend</b>. Слежу, чтобы код не повторялся, а реализация функционала была очевидной и удобной. Стремлюсь закрывать спринт как можно раньше (используем SCRUM методологию). При разработке сайта забочусь о дальнейшей поддержке и внедрение нового функционала. Люблю экспериментировать с пользовательским интерфейсом. </p>
            <blockquote>Если не знаю, как решить задачу, ищу ответ на StackOverflow и иностранных ресурсах в первую очередь (решение беру из ответа, а не вопроса).</blockquote>
            <p>В ближайшем будущем планирую достичь уровня Senior Frontend. Хочу заниматься программированием, а не бюрократией. Запускаю онлайн-курс по обучение frontend-разработки, поэтому имею открытое ИП. В свободное от работы время занимаюсь разработкой персональных идей.</p>
            <p><b>Ожидаемая работа:</b> программисты занимаются разработкой большую часть времени, менеджеры строго придерживаются методологии постановки задач, гибкий график прихода на работу, в компании определен стек технологий, намечен вектор развития компании, ЗП выплачивается в строго указанные сроки, компания поддерживает участие сотрудников на конференциях, есть план развития сотрудников.</p>
            <p><strong>Текущий фокус:&#8195;</strong>
                <a href="https://refactoring.guru/ru/design-patterns" target="_blank">Паттерны проектирования</a><span>&#8195;//&#8195;</span>
                <a href="https://vuejs.org/" target="_blank">Vue</a><span>&#8195;//&#8195;</span>
                <a href="https://nodejs.org/en/about/" target="_blank">Node.js</a><span>&#8195;//&#8195;</span>
                <a href="https://www.smashingmagazine.com/" target="_blank">UX</a></p>
        </div>
    </section>
</template>

<style scoped lang="less">
    .container{
        max-width: 800px;
        overflow: hidden;
    }
</style>
